Ran Plan for dir: `terraform/prd` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.sg.aws_security_group.test-sg will be created
+ resource "aws_security_group" "test-sg" {
      + arn                    = (known after apply)
      + description            = "The floor is SPIKES!!!"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tester SPIKES!"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Floor"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/prd`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=thetalorian%252Fpeepspace%252Fterraform%252Fprd%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/prd`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
